{
  "_name_or_path": "deprem-ml/deprem-ner",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-no",
    "2": "I-no",
    "3": "B-mahalle",
    "4": "I-mahalle",
    "5": "B-ad-soyad",
    "6": "I-ad-soyad",
    "7": "B-kat",
    "8": "I-kat",
    "9": "B-ilce",
    "10": "I-ilce",
    "11": "B-sokak",
    "12": "I-sokak",
    "13": "B-dis kapi no",
    "14": "I-dis kapi no",
    "15": "B-Apartman/Site",
    "16": "I-Apartman/Site",
    "17": "B-ic kapi no",
    "18": "I-ic kapi no",
    "19": "B-il",
    "20": "I-il"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-Apartman/Site": 15,
    "B-ad-soyad": 5,
    "B-dis kapi no": 13,
    "B-ic kapi no": 17,
    "B-il": 19,
    "B-ilce": 9,
    "B-kat": 7,
    "B-mahalle": 3,
    "B-no": 1,
    "B-sokak": 11,
    "I-Apartman/Site": 16,
    "I-ad-soyad": 6,
    "I-dis kapi no": 14,
    "I-ic kapi no": 18,
    "I-il": 20,
    "I-ilce": 10,
    "I-kat": 8,
    "I-mahalle": 4,
    "I-no": 2,
    "I-sokak": 12,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.28.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 32000
}
